Revit 2027 API
FamilyNestingBehavior Enumeration
 This attribute describes the family nesting behavior.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FamilyNestingBehavior
Public Enumeration FamilyNestingBehavior
public enum class FamilyNestingBehavior
type FamilyNestingBehavior
Members
Member name | Value | Description
Embedded | 0
Shared | 1
Subelement | 2
See Also
Reference
Autodesk.Revit.DB Namespace